// ignore_for_file: unnecessary_overrides

import 'package:get/get.dart';
import 'package:CNIQUE/app/core/constants/images_assets_constants.dart';
import 'package:CNIQUE/app/core/constants/strings_assets_constants.dart';

class DescriptionController extends GetxController {
  RxInt indexOfpage = 0.obs;
//=== قائمة بها مجموعة القوائم الموجودة في التطبيق ===

//================ قائمة العناوين ====================

//================ قائمة الصور ======================
  RxList<String> listOfImage = [
    ImagesAssetsConstants.listImages5, //1
    ImagesAssetsConstants.listImages6, //2
  ].obs;
//==================  1  ====================
  RxList<String> listTitle1 = [
    "امراض القلب هل تعتبر وراثية ؟",
    "3 أشياء يحتاج كل شخص يعاني من ارتفاع ضغط الدم إلى معرفتها"
  ].obs;

//================== 4  ====================
  RxList<String> listTitle4 = [
    "أمراض القلب هي مجموعة من الحالات التي تؤثر على عمل القلب والأوعية الدموية المحيطة وتعتبر الاصابة ب أمراض القلب هي السبب الرئيسي للوفاة في العديد من الدول و هناك العديد من الأشياء التي يمكن أن تزيد من خطر الإصابة ب أمراض القلب و يطلق عليهم عوامل الخطر بعضها لا يمكنك التحكم فيها و  لكن هناك الكثير من العوامل التي يمكنك التحكم فيها و التعرف عليها يمكن أن يقلل من خطر الإصابة ب أمراض القلب.\n"
        "\n"
        "وهناك العديد من امراض القلب أهمها : \n"
        "1. أمراض الشرايين التاجية :  وهي الحالة التي تحدث عندما تتضيق الشرايين التي تغذي العضلة القلبية بالدم، ويمكن أن يؤدي ذلك إلى نوبة قلبية.\n"
        "2. أمراض الصمامات القلبية : وهي الحالة التي تحدث عندما تكون الصمامات التي تسمح للدم بالتدفق باتجاه القلب والخروج منه غير فعالة، ويمكن أن تؤدي إلى تضخم القلب وعدم قدرته على القيام بوظيفته.\n"
        "3. الارتفاع في ضغط الدم : وهي الحالة التي تحدث عندما يكون ضغط الدم أعلى من المعدل الطبيعي، ويمكن أن يؤدي إلى تلف الأوعية الدموية وتدهور صحة القلب.\n"
        " \n"
        "اعراض امراض القلب \n"
        "تختلف اعراض امراض القلب وفقًا لنوع الحالة وشدتها أبرز اعراض امراض القلب : \n"
        " \n"
        "1. الم في الصدر : يكون الألم شديدًا أو متوسطًا  وقد يشعر الشخص بضغط أو ضيق في الصدر \n"
        "2. صعوبة بالتنفس : يمكن أن يكون التنفس صعبًا ومتقطعًا\n"
        "3. الدوخة و الاغماء : يشعر الشخص بالدوخة أو الإغماء بسبب نقص التروية الدموية إلى الدماغ\n"
        "4. التعرق الشديد :  يمكن أن يتعرق الشخص بشكل غير طبيعي، خاصةً عندما يشعر بالألم بالصدر\n"
        "5. الغثيان : يمكن أن يشعر الشخص بالغثيان والقيء\n"
        " \n"
        "أخطر أنواع أمراض القلب : \n"
        " \n"
        "1. النوبة القلبية :  وتعد النوبة القلبية من أخطر أنواع أمراض القلب، حيث يحدث توقف في تدفق الدم إلى القلب مما يؤدي إلى تلف جزء من العضلة القلبية\n"
        "2. الذبحة الصدرية : وهي حالة يشعر فيها الشخص بألم حاد في الصدر، يمكن أن يستمر لفترة وجيزة أو يزداد شدته مع الوقت، وهي تشير إلى وجود تضيق في الشرايين التاجية التي تغذي القلب بالدم، وإذا لم يتم علاجها\n "
        "3. الخفقان القلبي الخطير: وهو اضطراب في دقات القلب\n"
        "4. التهاب القلب : وهو حالة تسببها العدوى وتؤثر على الأغشية المحيطة بالقلب\n"
        "5. القصور القلبي :  وهو اضطراب يحدث نتيجة تضخم القلب أو تلف العضلة القلبية \n"
        " أمراض القلب التنفسية التي تؤثر على القلب والأوعية الدموية بشكل مباشر نتيجة لللتوتر والضغوط النفسية الشديدة والاضطرابات النفسية الأخر , ومن الامثلة على هذه الأمراض : \n"
        "1. ارتفاع ضغط الدم النفسي : وهو عبارة عن ارتفاع في ضغط الدم الذي ينتج عن التوتر النفسي المزمن  وقد يؤدي إلى تضيق  في الأوعية الدموية وزيادة خطر الإصابة بأمراض القب \n"
        "2. الاضطرابات النفسية الأخرى : مثل الاكتئاب والقلق والتوتر والإجهاد , والتي قد تؤدي إلى تغيرات في النظام القلبي والدوراني وزيادة خطر الإصابة ب امراض القلب  \n"
        "3. تضيق الشرايين التاجية : وهو عبارة عن تضيق في الشرايين التي تغذي القلب بالدم \n"
        " \n"
        "هل امراض القلب وراثية ؟ \n"
        " \n"
        "يوجد العديد من اسباب امراض القلب أهمها  \n"
        " 1. العوامل الوراثية: يمكن أن يزيد وجود أمراض القلب في الأسرة من خطر الإصابة بالأمراض القلبية\n"
        "2.  العوامل الصحية: مثل ارتفاع ضغط الدم وارتفاع مستوى الكوليسترول في الدم والسكري والسمنة والتدخين، وكلها تزيد من خطر الإصابة بأمراض القلب\n"
        "3. العوامل النفسية: مثل التوتر والقلق والاكتئاب وعدم التحكم بالضغوط النفسية والتعامل السليم معها، ويمكن أن تؤدي هذه العوامل إلى زيادة خطر الإصابة بأمراض القلب\n"
        "4. العوامل البيئية: مثل التلوث والتعرض لمواد كيميائية خطيرة، وكلها قد تؤدي إلى زيادة خطر الإصابة بأمراض القلب\n"
        " \n"
        "ما هي عوامل خطر الإصابة ب امراض القلب التي لا يمكنني تغييرها؟\n"
        " \n"
        "1.  العمر: يزداد خطر إصابتك بأمراض القلب مع تقدمك في السن. الرجال الذين يبلغون من العمر 45 عامًا أو أكثر والنساء الذين يبلغون من العمر 55 عامًا أو أكثر يكون لديهم مخاطر أكبر.\n"
        "2.الجنس: قد تؤثر بعض عوامل الخطر على خطر الإصابة بأمراض القلب لدى النساء بشكل مختلف عن الرجال على سبيل المثال ، يوفر الإستروجين بعض الحماية للنساء من أمراض القلب ، لكن مرض السكري يزيد من خطر الإصابة بأمراض القلب لدى النساء أكثر من الرجال.\n"
        "3.التاريخ العائلي :  يكون لديك خطر أكبر إذا كان لدى أحد أفراد الأسرة المقربين مصاب بمرض القلب في سن مبكرة.\n"
        " \n"
        "ما الذي يمكنني فعله لتقليل مخاطر الإصابة بأمراض القلب؟ \n"
        " \n"
        "1.التحكم في ضغط الدم :  ارتفاع ضغط الدم هو عامل خطر رئيسي لأمراض القلب. من المهم فحص ضغط الدم بانتظام - مرة واحدة في السنة على الأقل لمعظم البالغين للوقاية من ارتفاع ضغط الدم أو السيطرة عليه.\n"
        "2.المحافظة  على مستويات الكوليسترول والدهون الثلاثية :  يمكن أن تؤدي المستويات المرتفعة من الكوليسترول إلى انسداد الشرايين وزيادة خطر الإصابة بأمراض الشريان التاجي والنوبات القلبية \n"
        "3.الحافظ على وزن صحي: يمكن أن تؤدي زيادة الوزن أو السمنة إلى زيادة خطر الإصابة بأمراض القلب \n"
        "4.اتباع نظام غذائي صحي: لمحاولة الحد من الدهون المشبعة والأطعمة الغنية بالصوديوم والسكريات المضافة و  تناول الكثير من الفاكهة الطازجة والخضروات والحبوب الكاملة.\n"
        "5. ممارسة التمارين الرياضية بانتظام: حيث  يساعدك  في الحفاظ على وزن صحي وخفض الكوليسترول وضغط الدم كل هذه يمكن أن تقلل من خطر الإصابة بأمراض القلب.\n"
        "6. إدارة مرض السكري: تضاعف الإصابة بمرض السكري من خطر الإصابة بأمراض القلب السكري. وذلك لأنه بمرور الوقت ، يمكن أن يؤدي ارتفاع نسبة السكر في الدم من مرض السكري إلى تلف الأوعية الدموية والأعصاب التي تتحكم في القلب والأوعية الدموية. لذلك ، من المهم إجراء اختبار لمرض السكري ، وإذا كنت مصابًا به ، فاحتفظ به تحت السيطرة. \n",
    "إذا كنت تعاني من ارتفاع ضغط الدم ، فمن المحتمل أنك قلق بشأن السيطرة عليه. ويجب أن تكون كذلك. ارتفاع ضغط الدم هو عامل خطر رئيسي لأمراض القلب (السبب الرئيسي للوفاة) والسكتة الدماغية (رابع سبب رئيسي للوفاة) ويساهم في أكثر من 1100 حالة وفاة في اليوم. الجانب الأكثر إثارة للدهشة هو أن معظم هذه الوفيات يمكن منعها. لدينا علاجات فعالة وغير مكلفة لارتفاع ضغط الدم ، ومع ذلك يتم التحكم في أقل من 44٪ من حالات ارتفاع ضغط الدم. إن التأثير المدمر على صحتنا وطول العمر الناتج عن ارتفاع ضغط الدم غير المنضبط أمر غير مقبول ، وقد دفع الجراح العام في الولايات المتحدة إلى إطلاق نداء للعمل من أجل السيطرة على ارتفاع ضغط الدم للمساعدة في تحسين صحة الأشخاص المصابين بارتفاع ضغط الدم. إذا كنت مهتمًا بالتحكم في ضغط الدم لديك ، فهناك ثلاث نتائج أدبيات طبية جديدة يجب أن تعرفها. **من المهم مراقبة ضغط الدم في المنزل.** مثل معظم الأطباء ، اعتقدت دائمًا أن ضغط الدم الأكثر دقة هو الذي يتم تناوله في عيادتي ، ويفضل أن يكون ذلك من قبلي. لكن الأبحاث التي أجريت في السنوات الأخيرة أظهرت أن ضغط الدم في المكتب غالبًا ما يكون غير دقيق. تظهر الدراسات أن 65٪ من ضغط الدم في المكتب غير صحيح. أظهرت أبحاث أخرى أن قياسات ضغط الدم في المنزل قد تكون مؤشرًا أفضل للمخاطر من القياسات المكتبية وأن المراقبة في المنزل تقلل ضغط الدم وتحسن التحكم. العديد من إرشادات خبراء ضغط الدم تؤيد الآن مراقبة ضغط الدم في المنزل بناءً على هذه المعلومات. أوصي بمراقبة ضغط الدم في المنزل لجميع مرضاي وأؤكد أن أفضل طريقة لقياس ضغط الدم هي الجلوس بهدوء لمدة 5 دقائق أولاً. **قد يكون من الأفضل تناول أدوية ضغط الدم ليلاً.** في الماضي ، كنت أعتقد أن ضغط الدم يكون أعلى خلال النهار ، لذلك من الأفضل تناول أدوية ضغط الدم في الصباح. ومع ذلك ، تشير الأبحاث الحديثة إلى أن تناول أدوية ضغط الدم في الليل يؤدي بشكل أفضل إلى خفض ضغط الدم ، والأهم من ذلك أنه قد يقلل من مخاطر الوفاة والنوبات القلبية وفشل القلب والسكتة الدماغية. التحذير الوحيد الذي لدي هو أنه إذا كنت تتناول دواء ضغط الدم وهو مدر للبول أو حبوب مائية ، فقد يكون من الأفضل تناوله في الصباح لتجنب الاضطرار إلى الذهاب إلى الحمام في الليل. **إذا كان من الصعب السيطرة على ضغط الدم ، فاسأل طبيبك عما إذا كانت هناك مشكلة هرمونية.** لقد عرفنا منذ فترة طويلة أن أحد أسباب ارتفاع ضغط الدم هو ارتفاع هرمون الألدوستيرون. كان يعتقد أن هذا نادر. ومع ذلك ، تشير الأبحاث الحديثة إلى أن ارتفاع مستويات الألدوستيرون قد يكون سببًا أكثر شيوعًا لارتفاع ضغط الدم مما كنا نظن. أظهرت إحدى الأوراق البحثية أن ما يصل إلى 20٪ من الأشخاص الذين يعانون من ارتفاع ضغط الدم الذي يصعب علاجه قد يكون لديهم مستويات عالية من الألدوستيرون ، على الرغم من أن شخصًا واحدًا فقط من كل 1000 شخص يتم اختبارهم بالفعل. لديك القدرة على تحمل ضغط الدم لديك. قد تكون التغييرات في نمط الحياة مثل ممارسة الرياضة بانتظام ، وتناول الأطعمة المغذية ، وتجنب الإفراط في تناول الكحوليات والملح ، والوصول إلى وزن صحي فعالة (أو أكثر!) من أي دواء. بالإضافة إلى تغيير نمط الحياة ، تحدث إلى طبيبك لمعرفة ما إذا كان يجب عليك مراقبة ضغط الدم في المنزل ، وتناول الأدوية الخاصة بك في الليل ، وربما اختبار مستويات الألدوستيرون المرتفعة."
  ].obs;

  RxBool isListVisible = false.obs;

  @override
  void onInit() {
    super.onInit();
  }

  @override
  void onReady() {
    super.onReady();
  }

  @override
  void onClose() {
    super.onClose();
  }
}
