// ignore_for_file: unnecessary_overrides

import 'package:get/get.dart';
import 'package:Merilao/app/core/constants/images_assets_constants.dart';
import 'package:Merilao/app/core/constants/strings_assets_constants.dart';

class DetailsController extends GetxController {
  RxList<String> textOfBottonWhatsApp = [
    "اطلب الان واحجز استشارتك ",
    "أطلب الخدمة ",
    "أطلب الخدمة ",
    "أطلب الخدمة ",
  ].obs;

//============== رقم الصفحة ============================
  RxInt indexOfpage = 0.obs;
//=== قائمة بها مجموعة القوائم الموجودة في التطبيق ===
  RxList<RxList<String>> createLists() {
    return [listTitle2, listTitle3, listTitle4, listTitle5, listTitle1].obs;
  }

//================ قائمة العناوين ====================
  RxList<String> listOfTitle = [
    StringsAssetsConstants.listTitle2,
    StringsAssetsConstants.listTitle3,
    StringsAssetsConstants.listTitle4,
    StringsAssetsConstants.listTitle5,
    StringsAssetsConstants.listTitle1,
  ].obs;
//================ قائمة الصور ======================
  RxList<String> listOfImage = [
    ImagesAssetsConstants.listImages2, //1
    ImagesAssetsConstants.listImages5, //2
    ImagesAssetsConstants.listImages4, //3
    ImagesAssetsConstants.listImages3,
    ImagesAssetsConstants.listImages1, //4
  ].obs;
//==================  1  ====================
  RxList<String> listTitle1 = [
    // "•	نبذة عن ميريلاو \n"
    // " \n"
    "ميريلاو هي منصة رقمية مبتكرة تُحدث ثورة في عالم الاستشارات القانونية عن بُعد، مخصصة لخدمة العملاء في كافة أنحاء الوطن. تتيح ميريلاو للعملاء الوصول بسهولة وأمان إلى نخبة من المحامين والخبراء القانونيين المتخصصين، لتلبية احتياجاتهم القانونية بفعالية ومهنية.\n"
        " \n"
        // " •	لماذا تختار ميريلاو \n"
        "تقوم ميريلاو بتوفير تجربة سلسة ومريحة، حيث يتمكن العملاء من طلب الاستشارات والخدمات القانونية بنقرات بسيطة، مع ضمان الحفاظ على سرية وخصوصية بياناتهم. تعتمد المنصة على القوانين والتشريعات المحلية لضمان تقديم استشارات دقيقة وموثوقة، مما يجعلها الخيار الأمثل لمن يبحث عن حلول قانونية محترفة وآمنة.\n"
        " \n"
        "سواء كنت بحاجة إلى استشارة قانونية عاجلة أو ترغب في الحصول على نصيحة متخصصة، فإن ميريلاو توفر لك كل ما تحتاجه في مكان واحد، مع تأكيد على الجودة والخصوصية والاحترافية. انضم إلى ميريلاو اليوم، واستفد من الخبرات القانونية الواسعة بطريقة مبتكرة وحديثة.\n"
        "\n"
  ].obs;

  RxList<int> indexListOflist1 = [1, 2].obs;
//==================  2  ====================
  RxList<String> listTitle2 = [
    "الاستشارة القانونية هي الطريق الأمثل للوصول إلى الرأي القانوني الصحيح من خلال الاستعانة بخبراء ومتخصصين في مجال القانون. سواء كنت تواجه نزاعًا قانونيًا أو ترغب في معرفة التصرف السليم من الناحية القانونية، يُقدم المحامي الاستشارة الدقيقة والحل المناسب للمسألة المطروحة أمامه. الآن، ومع ميريلاو، أصبح الحصول على هذه الاستشارات أسهل وأسرع من أي وقت مضى، حيث يمكنك التواصل مع أفضل المحامين والخبراء عبر الواتساب مباشرة.\n"
        " \n"
        "لا تدع القلق القانوني يثقل كاهلك، تواصل الآن مع ميريلاو عبر الواتساب واستفد من الخبرات القانونية الواسعة بطريقة مبتكرة وآمنة."
  ].obs;
//================== 3  ====================
  RxList<String> listTitle3 = [
    "\n"
        "اكتسب مهارات ومعارف جديدة مع خدمات تدريب الأفراد. سواء كنت تسعى لتحسين مهاراتك الشخصية، المهنية، التقنية، أو حتى الهوايات، نحن نقدم لك التدريب الذي سيزيد من كفاءتك ويعزز قدراتك.\n"
        "\n"
  ].obs;
//================== 4  ====================
  RxList<String> listTitle4 = [
    "\n"
        "•	تدريب مجموعة للمؤسسات العمومية أو الشركات\n"
        "\n"
        "ارتقِ بأداء فريقك مع خدمات التدريب المصممة خصيصًا للمؤسسات العامة والشركات. استفد من التدريبات في مجالات مثل القيادة، إدارة المشاريع، التواصل الفعال، والتدريب التقني لتعزيز الإنتاجية وتحسين الأداء الجماعي لمؤسستك.\n"
  ].obs;
  RxList<String> listTitle5 = [
    "\n"
        "احصل على دعم قانوني متخصص من خلال خدمة توكيل المحامي. سواء كنت بحاجة إلى دفاع قانوني في المحكمة، إعداد مستندات قانونية، مشورة قانونية مستمرة، أو التفاوض على تسويات، نوفر لك محاميًا يحمي حقوقك ويقدم لك الدعم اللازم. \n"
        "\n"
  ].obs;
  RxList<String> listTitle6 = [
    // "لماذا منصة ميريلاو متميزة؟ \n"
    "  \n"
        " -	كوادرنا متواجدون لخدمتك 24 ساعة لتلبية كل احتياجاتك القانونية في جميع أنحاء الوطن.\n"
        " -	ضمان التزام المحامي والحفاظ على سرية وخصوصية سجلات القضية وبيانات العميل.\n"
        " -	الاستشارة تكون عن طريق مكالمة هاتفية مع المحامي المختص من خلال التطبيق.\n"
        " -	سهولة استخدام التطبيق وتحديد موعد الاستشارة أو الخدمة القانونية وفقا لراحتك.\n"
        " -	محامين ومستشارين ومدربين ذو خبرة واسعة ومتنوعة ومتعددة في جميع المجالات القانونية والقضائية.\n"
        " -	توفر لك منصة ميريلاو سهولة العودة للخدمة والاستشارات السابقة.\n"
        " -	توفير خدمات استشارية قانونية بتكلفة منافسة وخدمة الدفع الالكتروني.\n"
        " -	مجانية الاستشارة والتدريب للفئة المعدمة. \n"
  ].obs;
  RxBool isListVisible = false.obs;

  @override
  void onInit() {
    super.onInit();
  }

  @override
  void onReady() {
    super.onReady();
  }

  @override
  void onClose() {
    super.onClose();
  }
}
